#句読点バグ修正

#変数定義
fnum=0
num=0

##バグ
#2020/08/18
#文中に、。がないと改行されず,最後のセッドコマンドで全文消去されてしまう
#対応shell
#sed -e '/底本：/,/はボランティアの皆さんです。/ s/.*//g' -e '/-------------------------------------------------------/,/-------------------------------------------------------/ s/.*//g' -e '1,3d' -e 's/《[^》]\+》//g' -e "s/［＃[^］]\+］//g" -e "s/｜//g" -e "s/、//g" -e 's/ //g' -e 's/　//g' -e 's/（//g' -e 's/）//g' -e 's/「//g' -e 's/」//g' $file-utf8 | sed -e 's/。/\n/g' -e 's/！/！\n/g' -e 's/？/？\n/g' | sed '/^$/d' > $file-utf8-remove


#文字コードをutf8へ変換し，改行コードをLF(\n)へ変換
for file in ../data/*/*2/*.txt; do
	echo $file
	nkf -w -Lu $file > $file-utf8

    ##不要な行や脚注、ルビの削除	
	#末尾の記載　記号の説明部分　冒頭3行　脚注　ルビ　半角全角スペース　の削除　＞　txt-utf8-removeディレクトリへ
	# Formating1より右記の記号削除をしないこととする　-e "s/、//g"  -e 's/（//g' -e 's/）//g' -e 's/「//g' -e 's/」//g'　また、句点"。"も削除しない。
	sed -e '/底本：/,/はボランティアの皆さんです。/ s/.*//g' -e '/-------------------------------------------------------/,/-------------------------------------------------------/ s/.*//g' -e '1,3d' -e 's/《[^》]\+》//g' -e "s/［＃[^］]\+］//g" -e "s/｜//g" -e 's/ //g' -e 's/　//g' $file-utf8 | sed -e 's/。/。\n/g' -e 's/！/！\n/g' -e 's/？/？\n/g' | sed '/^$/d' > $file-utf8-remove2

	rm $file-utf8

done
exit;
